# PANDAS :-

In [572]:
import pandas as pd

In [573]:
print(f"Pandas Version : {pd.__version__}")

Pandas Version : 2.2.3

## Serise :

### Serise Create, Manipulate, Querry, Delete :

In [574]:
# Creating Serise from list :
arr = [8,5,4,6,7]
print(arr,"\n")

S1 = pd.Series(arr)
print("S1 :")
print(S1,"\n")
print("Second of S1 :",S1[1])

[8, 5, 4, 6, 7]

S1 :
0    8
1    5
2    4
3    6
4    7
dtype: int64

Second of S1 : 5

In [575]:
order = [1,2,3,4,5]

S2 = pd.Series(arr,index = order)
print("S2 :")
print(S2)

S2 :
1    8
2    5
3    4
4    6
5    7
dtype: int64

In [576]:
import numpy as np

x = np.random.randn(5) # Create random array 
print(x,"\n")

index = ["a","b","c","d","e"]
S2 = pd.Series(x,index = index)
print("S2 :")
print(S2)

[-0.74615343 -0.06221165 -0.26611884  0.01234262 -0.16439129]

S2 :
a   -0.746153
b   -0.062212
c   -0.266119
d    0.012343
e   -0.164391
dtype: float64

In [577]:
# Modify index of Serise

S1.index = ["A","B","C","D","E"]
print("Modified S1 :")
print(S1,"\n")

# Slicing of Serise

a = S1[1:4] # start : 2nd collumn ; end : 5th collumn
print("a :")
print(a,"\n")

Modified S1 :
A    8
B    5
C    4
D    6
E    7
dtype: int64

a :
B    5
C    4
D    6
dtype: int64

In [578]:
# Creating Serise from dictionary :
y = {
     "a" : 1,
     "f" : 4,
     "c" : 3,
     "j" : 9,
     "e" : 6
     }
print(y,"\n")

S3 = pd.Series(y)
print("S3 :")
print(S3)

{'a': 1, 'f': 4, 'c': 3, 'j': 9, 'e': 6}

S3 :
a    1
f    4
c    3
j    9
e    6
dtype: int64

In [579]:
# concating two Series
S4 = pd.concat([S1, S3])
print("S4 :")
print(S4,"\n")

z = S4.drop("a") # remove index a from S4
print(z)

S4 :
A    8
B    5
C    4
D    6
E    7
a    1
f    4
c    3
j    9
e    6
dtype: int64

A    8
B    5
C    4
D    6
E    7
f    4
c    3
j    9
e    6
dtype: int64

### Serise Operations :

In [580]:
arr1 = [0,1,9,2,7]
arr2 = [5,4,10,6,9]

In [581]:
S5 = pd.Series(arr1)
print("S5 :")
print(S5,"\n")

S6 = pd.Series(arr2)
print("S6 :")
print(S6)

S5 :
0    0
1    1
2    9
3    2
4    7
dtype: int64

S6 :
0     5
1     4
2    10
3     6
4     9
dtype: int64

In [582]:
a = S6.add(S5) # S6[0] , S5[0] : S6[1] , S5[1] : S6[2] , S5[2] ....
print(a)

0     5
1     5
2    19
3     8
4    16
dtype: int64

In [583]:
b = S6.sub(S5) # S6[0] - S5[0] , S6[1] - S5[1] , S6[2] - S5[2] ....
print(b)

0    5
1    3
2    1
3    4
4    2
dtype: int64

In [584]:
c = S6.mul(S5) # S6[0] * S5[0] , S6[1] * S5[1] , S6[2] * S5[2] ....
print(c)

0     0
1     4
2    90
3    12
4    63
dtype: int64

In [585]:
d = S6.div(S5) # S6[0] / S5[0] , S6[1] / S5[1] , S6[2] / S5[2] ....
print(d)

0         inf
1    4.000000
2    1.111111
3    3.000000
4    1.285714
dtype: float64

In [586]:
e = S6.median() # median of S6
print(e)

6.0

In [587]:
f = S6.max()
print("Max : ",f)

g = S6.min()
print("Min : ",g)

Max :  10
Min :  4

## Dataframe :

### Creating Dataframe :

In [588]:
dates = pd.date_range("today",periods = 7) # Create a date range starting from today for 7 periods
num_arr = np.random.randn(7,4) # Import numpy array
collumn = ["A","B","C","D"] # Collumns Names
df1 = pd.DataFrame(num_arr,index = dates,columns = collumn) 
df1

                                   A         B         C         D
2025-07-18 17:24:29.905681  0.525888 -0.629801  0.425738 -1.330429
2025-07-19 17:24:29.905681  0.625791  0.282217 -0.635762 -0.186056
2025-07-20 17:24:29.905681 -0.020649 -0.147364 -0.170699 -1.125181
2025-07-21 17:24:29.905681 -1.903001 -0.805219  1.444392 -0.122464
2025-07-22 17:24:29.905681 -0.787568 -1.469491  0.152507  0.286965
2025-07-23 17:24:29.905681  0.836932  0.279716 -1.633184 -0.633332
2025-07-24 17:24:29.905681  0.227584 -1.029841 -0.344354  1.343410

In [589]:
# Creat DataFrame from Dictionary

data = {"Restaurants"    : ["Pizza Hut","Domino's","KFC","Burger King","Lapino's","McDonlads","Star Bucks"],
        "Rating"         : [ 4.5 , 3.5 , 4 , 4.2 , 3.9 , 4.3 , 4.7 ],
        "Sales per Year" : [ 100000 , 80000 , 120000 , 95000 , 90000 , 180000 , 200000 ],
        "Location"       : [ "Pal" , "Adajan" , "Vesu" , "Ugat" , "Bhesan" , "Begampura" , "Katargam" ],
        "Open"           : [ True , False , True , True , False , True , False ]
        } # we can use : np.nan -> print NaN(Not a Number) => if we have not value
# Restaurants, Rating, Sales per Year, Location, Open is collumn names

# Index for the DataFrame 
index = [1,2,3,4,5,6,7] # We can use also ["A","B","C","D","E","F","G"]

df2 = pd.DataFrame(data,index=index)
df2

   Restaurants  Rating  Sales per Year   Location   Open
1    Pizza Hut     4.5          100000        Pal   True
2     Domino's     3.5           80000     Adajan  False
3          KFC     4.0          120000       Vesu   True
4  Burger King     4.2           95000       Ugat   True
5     Lapino's     3.9           90000     Bhesan  False
6    McDonlads     4.3          180000  Begampura   True
7   Star Bucks     4.7          200000   Katargam  False

In [590]:
# see datatye of array of dictionary

x = df2.dtypes
print("df2 : ")
print(x,"\n")

df2 :
Restaurants        object
Rating            float64
Sales per Year      int64
Location           object
Open                 bool
dtype: object

In [591]:
y = df2.head(2) # see top 2 rows
print(y)

print("\n")

z = df2.tail(3) # see bottom 3 rows
print(z)

  Restaurants  Rating  Sales per Year Location   Open
1   Pizza Hut     4.5          100000      Pal   True
2    Domino's     3.5           80000   Adajan  False


  Restaurants  Rating  Sales per Year   Location   Open
5    Lapino's     3.9           90000     Bhesan  False
6   McDonlads     4.3          180000  Begampura   True
7  Star Bucks     4.7          200000   Katargam  False

In [592]:
p = df2.index # see index of DataFrame df2
print(p)

print("\n")

q = df2.values
print(q)

print("\n")

r = df2.describe()
r

Index([1, 2, 3, 4, 5, 6, 7], dtype='int64')


[['Pizza Hut' 4.5 100000 'Pal' True]
 ["Domino's" 3.5 80000 'Adajan' False]
 ['KFC' 4.0 120000 'Vesu' True]
 ['Burger King' 4.2 95000 'Ugat' True]
 ["Lapino's" 3.9 90000 'Bhesan' False]
 ['McDonlads' 4.3 180000 'Begampura' True]
 ['Star Bucks' 4.7 200000 'Katargam' False]]

         Rating  Sales per Year
count  7.000000        7.000000
mean   4.157143   123571.428571
std    0.399404    47321.091643
min    3.500000    80000.000000
25%    3.950000    92500.000000
50%    4.200000   100000.000000
75%    4.400000   150000.000000
max    4.700000   200000.000000

In [593]:

t = df2.T # convert in to horizontal # if  df2 = A  so  t = A' 
t

,1,2,3,4,5,6,7
Restaurants,Pizza Hut,Domino's,KFC,Burger King,Lapino's,McDonlads,Star Bucks
Rating,4.5,3.5,4.0,4.2,3.9,4.3,4.7
Sales per Year,100000,80000,120000,95000,90000,180000,200000
Location,Pal,Adajan,Vesu,Ugat,Bhesan,Begampura,Katargam
Open,True,False,True,True,False,True,False

In [594]:
# Sorting DataFrame

u = df2.sort_values("Rating") # Sorted by Rating
print(u)

print("\n")

v = df2.sort_values("Sales per Year") # Sorted by Sales per Year	
print(v)

   Restaurants  Rating  Sales per Year   Location   Open
2     Domino's     3.5           80000     Adajan  False
5     Lapino's     3.9           90000     Bhesan  False
3          KFC     4.0          120000       Vesu   True
4  Burger King     4.2           95000       Ugat   True
6    McDonlads     4.3          180000  Begampura   True
1    Pizza Hut     4.5          100000        Pal   True
7   Star Bucks     4.7          200000   Katargam  False


   Restaurants  Rating  Sales per Year   Location   Open
2     Domino's     3.5           80000     Adajan  False
5     Lapino's     3.9           90000     Bhesan  False
4  Burger King     4.2           95000       Ugat   True
1    Pizza Hut     4.5          100000        Pal   True
3          KFC     4.0          120000       Vesu   True
6    McDonlads     4.3          180000  Begampura   True
7   Star Bucks     4.7          200000   Katargam  False

In [595]:
# Slicing DataFrame

a = df2[3:6]
print(a)

print("\n")

b = df2.sort_values("Rating")[3:6] # Sorted by Rating and then sliced from 3 to 6
print(b)

   Restaurants  Rating  Sales per Year   Location   Open
4  Burger King     4.2           95000       Ugat   True
5     Lapino's     3.9           90000     Bhesan  False
6    McDonlads     4.3          180000  Begampura   True


   Restaurants  Rating  Sales per Year   Location  Open
4  Burger King     4.2           95000       Ugat  True
6    McDonlads     4.3          180000  Begampura  True
1    Pizza Hut     4.5          100000        Pal  True

In [596]:
# query DataFrame by Tag

df2[["Rating","Sales per Year"]] # print Rating and Sales per Year columns
# query collumns

   Rating  Sales per Year
1     4.5          100000
2     3.5           80000
3     4.0          120000
4     4.2           95000
5     3.9           90000
6     4.3          180000
7     4.7          200000

In [597]:
df2.iloc[1:3] # query rows
# it's like slicing of DataFrame

  Restaurants  Rating  Sales per Year Location   Open
2    Domino's     3.5           80000   Adajan  False
3         KFC     4.0          120000     Vesu   True

In [598]:
# Copy DataFrame

df3 = df2.copy() # df3 is copy of df2
df3

   Restaurants  Rating  Sales per Year   Location   Open
1    Pizza Hut     4.5          100000        Pal   True
2     Domino's     3.5           80000     Adajan  False
3          KFC     4.0          120000       Vesu   True
4  Burger King     4.2           95000       Ugat   True
5     Lapino's     3.9           90000     Bhesan  False
6    McDonlads     4.3          180000  Begampura   True
7   Star Bucks     4.7          200000   Katargam  False

In [599]:
# Add new row to DataFrame

# df3.loc["index","collumn name"] = "value"
df3.loc["8","Restaurants"] = "Saffron"
df3.loc["8","Rating"] = 4.2
df3.loc["8","Location"] = "Bhatar"
df3.loc["8","Open"] = True
df3

   Restaurants  Rating  Sales per Year   Location   Open
1    Pizza Hut     4.5        100000.0        Pal   True
2     Domino's     3.5         80000.0     Adajan  False
3          KFC     4.0        120000.0       Vesu   True
4  Burger King     4.2         95000.0       Ugat   True
5     Lapino's     3.9         90000.0     Bhesan  False
6    McDonlads     4.3        180000.0  Begampura   True
7   Star Bucks     4.7        200000.0   Katargam  False
8      Saffron     4.2             NaN     Bhatar   True

In [600]:
df3.isnull() # check for null values in df3
# if there are no value then print True else False

   Restaurants  Rating  Sales per Year  Location   Open
1        False   False           False     False  False
2        False   False           False     False  False
3        False   False           False     False  False
4        False   False           False     False  False
5        False   False           False     False  False
6        False   False           False     False  False
7        False   False           False     False  False
8        False   False            True     False  False

In [601]:
c = df3.mean(numeric_only=True)
print(c)

print("\n")
 
d = df3["Sales per Year"].sum() # sum of Sales per Year
print("Sum of Sales per Year :", d)

Rating                 4.162500
Sales per Year    123571.428571
dtype: float64


Sum of Sales per Year : 865000.0

In [602]:
string = pd.Series(["A","Bat","Cat","DOG","AF","Food","G"])
print(string.str.lower(),"\n") 
print(string.str.upper(),"\n")
print(string.str.title())

0       a
1     bat
2     cat
3     dog
4      af
5    food
6       g
dtype: object

0       A
1     BAT
2     CAT
3     DOG
4      AF
5    FOOD
6       G
dtype: object

0       A
1     Bat
2     Cat
3     Dog
4      Af
5    Food
6       G
dtype: object

### Operation for Data Frame missing values :

In [603]:
df4 = df3.copy()
df4.fillna(99000)

/tmp/ipykernel_2547/145722489.py:2: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df4.fillna(99000)

   Restaurants  Rating  Sales per Year   Location   Open
1    Pizza Hut     4.5        100000.0        Pal   True
2     Domino's     3.5         80000.0     Adajan  False
3          KFC     4.0        120000.0       Vesu   True
4  Burger King     4.2         95000.0       Ugat   True
5     Lapino's     3.9         90000.0     Bhesan  False
6    McDonlads     4.3        180000.0  Begampura   True
7   Star Bucks     4.7        200000.0   Katargam  False
8      Saffron     4.2         99000.0     Bhatar   True

In [604]:
df5 = df3.copy()
df5.dropna(how = 'any') # it remove row when NaN value is present in any collumn

   Restaurants  Rating  Sales per Year   Location   Open
1    Pizza Hut     4.5        100000.0        Pal   True
2     Domino's     3.5         80000.0     Adajan  False
3          KFC     4.0        120000.0       Vesu   True
4  Burger King     4.2         95000.0       Ugat   True
5     Lapino's     3.9         90000.0     Bhesan  False
6    McDonlads     4.3        180000.0  Begampura   True
7   Star Bucks     4.7        200000.0   Katargam  False

### Open and Read Files :

In [605]:
file1 = pd.read_csv("output.csv") # read csv file
file1

FileNotFoundError: [Errno 2] No such file or directory: 'output.csv'

In [ ]:
file1.head(3)

    Name  Age       City
0   Yash   17      Surat
1   Meet   12    Navsari
2  Ayush   20  Ahmedabad

In [ ]:
file2 = pd.read_excel("output.xlsx") # read excel file
file2.tail(7)

     Name  Age       City
2   Ayush   20  Ahmedabad
3   Rudra   16      Surat
4    Veer   21   Vadodara
5     Jay   11   Jamnagar
6    Vraj   18     Rajkot
7  Tathya   17     Mumbai
8  Saumya   18  Ahemdabad

 ### Info of DataFrame :

In [ ]:
pd.DataFrame.info(df3)
# RangeIndex = number of rows
# Data column = number of columns

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, 1 to 8
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Restaurants     8 non-null      object
 1   Rating          8 non-null      float64
 2   Sales per Year  7 non-null      float64
 3   Location        8 non-null      object
 4   Open            8 non-null      object
dtypes: float64(2), object(3)
memory usage: 684.0+ bytes

### Sava a DataFrame in file :

In [ ]:
df3.to_csv("OutputWithIndex.csv",index = True)
df3.to_excel("OutputWithOutIndex.xlsx",index = False)